src/docs/Misc/misc.org
* 在ubuntu上搭建基于ree+nginx+passenger的rails3环境
http://www.yangzhiping.com/tech/ubuntu-ree-nginx-passenger-rails3.blog.html

* web前端

coda:web开发利器。商业收费软件。

cssedit:css编辑利器。商业收费软件。

ColorSchemer Studio:颜色软件。

* Writting
Node.js初学者教材 
https://github.com/ManuelKiessling/NodeBeginnerBook

backbone基础
https://github.com/addyosmani/backbone-fundamentals

Sinatra教程
https://github.com/cschneid/sinatra-book
https://github.com/sinatra/sinatra

* presentation
https://speakerdeck.com/

https://github.com/schacon/showoff

https://github.com/bartaz/impress.js



* GitHub简历生成器
http://resume.github.com/
* angel_nest
https://github.com/fredwu/angel_nest
* GitHire
http://githire.com/
* Gitalytics.com
http://www.gitalytics.com/


