public_html/docs/Misc/misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>misc</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="misc"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-29T00:47+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">misc</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 在ubuntu上搭建基于ree+nginx+passenger的rails3环境</a></li>
<li><a href="#sec-2">2 web前端</a></li>
<li><a href="#sec-3">3 Writting</a></li>
<li><a href="#sec-4">4 presentation</a></li>
<li><a href="#sec-5">5 GitHub简历生成器</a></li>
<li><a href="#sec-6">6 angel<sub>nest</sub></a></li>
<li><a href="#sec-7">7 GitHire</a></li>
<li><a href="#sec-8">8 Gitalytics.com</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 在ubuntu上搭建基于ree+nginx+passenger的rails3环境</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://www.yangzhiping.com/tech/ubuntu-ree-nginx-passenger-rails3.blog.html">http://www.yangzhiping.com/tech/ubuntu-ree-nginx-passenger-rails3.blog.html</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> web前端</h2>
<div class="outline-text-2" id="text-2">


<p>
coda:web开发利器。商业收费软件。
</p>
<p>
cssedit:css编辑利器。商业收费软件。
</p>
<p>
ColorSchemer Studio:颜色软件。
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Writting</h2>
<div class="outline-text-2" id="text-3">

<p>Node.js初学者教材 
<a href="https://github.com/ManuelKiessling/NodeBeginnerBook">https://github.com/ManuelKiessling/NodeBeginnerBook</a>
</p>
<p>
backbone基础
<a href="https://github.com/addyosmani/backbone-fundamentals">https://github.com/addyosmani/backbone-fundamentals</a>
</p>
<p>
Sinatra教程
<a href="https://github.com/cschneid/sinatra-book">https://github.com/cschneid/sinatra-book</a>
<a href="https://github.com/sinatra/sinatra">https://github.com/sinatra/sinatra</a>
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> presentation</h2>
<div class="outline-text-2" id="text-4">

<p><a href="https://speakerdeck.com/">https://speakerdeck.com/</a>
</p>
<p>
<a href="https://github.com/schacon/showoff">https://github.com/schacon/showoff</a>
</p>
<p>
<a href="https://github.com/bartaz/impress.js">https://github.com/bartaz/impress.js</a>
</p>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> GitHub简历生成器</h2>
<div class="outline-text-2" id="text-5">

<p><a href="http://resume.github.com/">http://resume.github.com/</a>
</p></div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> angel<sub>nest</sub></h2>
<div class="outline-text-2" id="text-6">

<p><a href="https://github.com/fredwu/angel_nest">https://github.com/fredwu/angel_nest</a>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> GitHire</h2>
<div class="outline-text-2" id="text-7">

<p><a href="http://githire.com/">http://githire.com/</a>
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Gitalytics.com</h2>
<div class="outline-text-2" id="text-8">

<p><a href="http://www.gitalytics.com/">http://www.gitalytics.com/</a>
</p>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-29T00:47+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
